models/tmr/bump/fine/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}


scale   1;

vertices
(
    (-25.0 0 0)     // 0
    (0.0 0 0)     // 1
    (1.5 0 0)     // 2
    (26.5 0 0)     // 3
    (26.5 5.0 0)   // 4
    (1.5 5.0 0)   // 5
    (0.0 5.0 0)   // 6
    (-25.0 5.0 0)   // 7
    (-25.0 0 1)     // 8
    (0.0 0 1)     // 9
    (1.5 0 1)     // 10
    (26.5 0 1)     // 11
    (26.5 5.0 1)   // 12
    (1.5 5.0 1)   // 13
    (0.0 5.0 1)   // 14
    (-25.0 5.0 1)   // 15
);

blocks
(
    hex (0 1 6 7 8 9 14 15) (48 160 1)
        simpleGrading (0.0021936996 274657.05 1)
    hex (1 2 5 6 9 10 13 14) (256 160 1)
        simpleGrading (1 274657.05 1)
    hex (2 3 4 5 10 11 12 13) (48 160 1)
        simpleGrading (455.85094 274657.05 1)
);

edges
(
    polyLine 1 2
    (
            (0.003125 0 0)
            (0.00625 0 0)
            (0.009375 0 0)
            (0.0125 0 0)
            (0.015625 0 0)
            (0.01875 0 0)
            (0.021875 0 0)
            (0.025 0 0)
            (0.028125 0 0)
            (0.03125 0 0)
            (0.034375 0 0)
            (0.0375 0 0)
            (0.040625 0 0)
            (0.04375 0 0)
            (0.046875 0 0)
            (0.05 0 0)
            (0.053125 0 0)
            (0.05625 0 0)
            (0.059375 0 0)
            (0.0625 0 0)
            (0.065625 0 0)
            (0.06875 0 0)
            (0.071875 0 0)
            (0.075 0 0)
            (0.078125 0 0)
            (0.08125 0 0)
            (0.084375 0 0)
            (0.0875 0 0)
            (0.090625 0 0)
            (0.09375 0 0)
            (0.096875 0 0)
            (0.1 0 0)
            (0.103125 0 0)
            (0.10625 0 0)
            (0.109375 0 0)
            (0.1125 0 0)
            (0.115625 0 0)
            (0.11875 0 0)
            (0.121875 0 0)
            (0.125 0 0)
            (0.128125 0 0)
            (0.13125 0 0)
            (0.134375 0 0)
            (0.1375 0 0)
            (0.140625 0 0)
            (0.14375 0 0)
            (0.146875 0 0)
            (0.15 0 0)
            (0.153125 0 0)
            (0.15625 0 0)
            (0.159375 0 0)
            (0.1625 0 0)
            (0.165625 0 0)
            (0.16875 0 0)
            (0.171875 0 0)
            (0.175 0 0)
            (0.178125 0 0)
            (0.18125 0 0)
            (0.184375 0 0)
            (0.1875 0 0)
            (0.190625 0 0)
            (0.19375 0 0)
            (0.196875 0 0)
            (0.2 0 0)
            (0.203125 0 0)
            (0.20625 0 0)
            (0.209375 0 0)
            (0.2125 0 0)
            (0.215625 0 0)
            (0.21875 0 0)
            (0.221875 0 0)
            (0.225 0 0)
            (0.228125 0 0)
            (0.23125 0 0)
            (0.234375 0 0)
            (0.2375 0 0)
            (0.240625 0 0)
            (0.24375 0 0)
            (0.246875 0 0)
            (0.25 0 0)
            (0.253125 0 0)
            (0.25625 0 0)
            (0.259375 0 0)
            (0.2625 0 0)
            (0.265625 0 0)
            (0.26875 0 0)
            (0.271875 0 0)
            (0.275 0 0)
            (0.278125 0 0)
            (0.28125 0 0)
            (0.284375 0 0)
            (0.2875 0 0)
            (0.290625 0 0)
            (0.29375 0 0)
            (0.296875 0 0)
            (0.3 0 0)
            (0.303125 7.078888837e-10 0)
            (0.30625 1.132352697e-08 0)
            (0.309375 5.730262123e-08 0)
...
    )
    polyLine 9 10
    (
            (0.003125 0 1)
            (0.00625 0 1)
            (0.009375 0 1)
            (0.0125 0 1)
            (0.015625 0 1)
            (0.01875 0 1)
            (0.021875 0 1)
            (0.025 0 1)
            (0.028125 0 1)
            (0.03125 0 1)
            (0.034375 0 1)
            (0.0375 0 1)
            (0.040625 0 1)
            (0.04375 0 1)
            (0.046875 0 1)
            (0.05 0 1)
            (0.053125 0 1)
            (0.05625 0 1)
            (0.059375 0 1)
            (0.0625 0 1)
            (0.065625 0 1)
            (0.06875 0 1)
            (0.071875 0 1)
            (0.075 0 1)
            (0.078125 0 1)
            (0.08125 0 1)
            (0.084375 0 1)
            (0.0875 0 1)
            (0.090625 0 1)
            (0.09375 0 1)
            (0.096875 0 1)
            (0.1 0 1)
            (0.103125 0 1)
            (0.10625 0 1)
            (0.109375 0 1)
            (0.1125 0 1)
            (0.115625 0 1)
            (0.11875 0 1)
            (0.121875 0 1)
            (0.125 0 1)
            (0.128125 0 1)
            (0.13125 0 1)
            (0.134375 0 1)
            (0.1375 0 1)
            (0.140625 0 1)
            (0.14375 0 1)
            (0.146875 0 1)
            (0.15 0 1)
            (0.153125 0 1)
            (0.15625 0 1)
            (0.159375 0 1)
            (0.1625 0 1)
            (0.165625 0 1)
            (0.16875 0 1)
            (0.171875 0 1)
            (0.175 0 1)
            (0.178125 0 1)
            (0.18125 0 1)
            (0.184375 0 1)
            (0.1875 0 1)
            (0.190625 0 1)
            (0.19375 0 1)
            (0.196875 0 1)
            (0.2 0 1)
            (0.203125 0 1)
            (0.20625 0 1)
            (0.209375 0 1)
            (0.2125 0 1)
            (0.215625 0 1)
            (0.21875 0 1)
            (0.221875 0 1)
            (0.225 0 1)
            (0.228125 0 1)
            (0.23125 0 1)
            (0.234375 0 1)
            (0.2375 0 1)
            (0.240625 0 1)
            (0.24375 0 1)
            (0.246875 0 1)
            (0.25 0 1)
            (0.253125 0 1)
            (0.25625 0 1)
            (0.259375 0 1)
            (0.2625 0 1)
            (0.265625 0 1)
            (0.26875 0 1)
            (0.271875 0 1)
            (0.275 0 1)
            (0.278125 0 1)
            (0.28125 0 1)
            (0.284375 0 1)
            (0.2875 0 1)
            (0.290625 0 1)
            (0.29375 0 1)
            (0.296875 0 1)
            (0.3 0 1)
            (0.303125 7.078888837e-10 1)
            (0.30625 1.132352697e-08 1)
            (0.309375 5.730262123e-08 1)
...
);

boundary
(
    inlet     { type patch;    faces ((0 8 15 7)); }
    outlet    { type patch;    faces ((3 4 12 11)); }
    top       { type symmetry; faces ((7 15 14 6) (6 14 13 5) (5 13 12 4)); }
    bottomSym { type symmetry; faces ((0 1 9 8) (2 3 11 10)); }
    bump      { type wall;     faces ((1 2 10 9)); }
    frontAndBack
    {
        type empty;
        faces ((0 7 6 1) (1 6 5 2) (2 5 4 3)
               (8 9 14 15) (9 10 13 14) (10 11 12 13));
    }
);
