models/tmr/bump/fine/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}


ddtSchemes      { default steadyState; }
gradSchemes     { default Gauss linear; }
divSchemes
{
    // Momentum second order; turbulence advection first-order upwind.
    // The A/B on the coarse grid: linearUpwind on k and omega left a
    // persistent leading-edge bounding oscillation (5997 bounding events,
    // residuals plateaued); upwind removed every bounding event and let the
    // run converge through residualControl. Turbulence advection is
    // negligible against production and destruction in this boundary layer,
    // and the measured observed order reports whatever the ladder delivers.
    default                         none;
    div(phi,U)                      bounded Gauss linearUpwind grad(U);
    div(phi,k)                      bounded Gauss upwind;
    div(phi,omega)                  bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
wallDist        { method meshWave; }
